package homework;

import java.util.Arrays;
import java.util.Scanner;

public class task1_5 {
    public static void main(String[] args) {
        System.out.println ("Введите элементы массива : ");

        Scanner sc = new Scanner(System.in);



        ///////////// 1.5 /////////////////////////////////////
/*
ВНИМАНИЕ! ДЛЯ РЕШЕНИЯ ЗАДАЧИ НЕОБХОДИМО ПРОСМОТРЕТЬ УРОК №4 https://www.youtube.com/watch?v=WmZ6kVTlWtg&list=PLOep0pi-UBExIxCNegkvCrBuDh0TE7Ihq&index=4
Программа запрашивает у пользователя значение в градусах Цельсия. Программа должена переводить температуру и выводить на экран
значение в градусах Фаренгейта.
Температура по Цельсию TC и температура по Фаренгейту TF связаны следующим соотношением:
TF = (9 / 5) * TC + 32
Пример:
на вход подается значение 41.
Пример вывода:
105.8 */

        //  Scanner sc = new Scanner(System.in);
//        System.out.println("Укажите темпиратуру градусах Цельсия");
//        double tc = sc.nextDouble();
//        double а = 9;
//        double b = 5;
//        double tf = (а/b)*tc+32;

        //       System.out.println(tf);

        /*1.6///////////////////////////////////////
Пользователь вводит число, необходимо увеличить это число на 15% и вывести результат на экран
*/
//        double a = sc.nextDouble();
//        double prozent = a/100*15;
//
//        System.out.println(a+prozent);

/////////////2.1////////////////////////////////////
//        String[] mma = {"мама", "мыла", "раму"};
//        for (int i = 0; i < mma.length; i++) {
//            for (int j = 0; j < mma.length; j++) {
//                for (int k = 0; k < mma.length; k++) {
//
//                    if(mma[i]!=mma[j]&&mma[j]!=mma[k]&&mma[i]!=mma[k])
//                    System.out.println(mma[i] + mma[j]+mma[k]);
//                }
//
//            }
//        }
        //////////////  2.10/////////////////

        /*
Задание: Дан массив с числами. Проверьте, есть ли в нем два одинаковых числа подряд. Если есть - выведите 'да', а если нет - выведите 'нет'.
*/

//        int[] aray = {1, 5, 4, 7,7,78, 8};
//
//
//
//        for (int i = 0; i == aray[i]; i++) {
//
//            for (int j = i+1; j < aray.length; j++) {
//                if (aray[i]==aray[j]){
//                    System.out.println("Y");
//                }
//
//            }



  //          }




//            if (aray[i] == aray[i+1]){
//
//                System.out.println("Y");
//
//        }else{
//                System.out.println("N");
//            }
            }



/*
Задание: Дан массив с числами. Узнайте сколько элементов с начала массива надо сложить, чтобы в сумме получилось больше 10-ти.
*/


        }


